Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
/* Copyright 2019 SiFive, Inc */
/* SPDX-License-Identifier: Apache-2.0 */

/* Kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"

/* BL808 includes. */
#include "bflb_uart.h"
#include "bflb_gpio.h"
#include "bflb_clock.h"
#include "bflb_rtc.h"
#include "bflb_flash.h"
#include "bl808_glb.h"
#include "bl808_psram_uhs.h"
#include "bl808_tzc_sec.h"
#include "bl808_ef_cfg.h"
#include "bl808_uhs_phy.h"
#include "board.h"
#include "mem.h"

#ifdef CONFIG_BSP_SDH_SDCARD
#include "sdh_sdcard.h"
#endif

#include "tzc_sec_reg.h"
#include "rv_hart.h"
#include "rv_pmp.h"

#include <printf.h>
#include "version.h">

struct bflb_device_s *uart0;
extern void bflb_uart_set_console(struct bflb_device_s *dev);

extern pmp_info_t xPmpInfo;

#define CONFIG_APPS_SPY
#define CONFIG_APPS_HELLO_WORLD

/* Priorities used by the tasks. */
#define mainQUEUE_RECEIVE_TASK_PRIORITY (tskIDLE_PRIORITY + 2)
#define mainQUEUE_SEND_TASK_PRIORITY (tskIDLE_PRIORITY + 1)

#ifndef _RTL_
/* The 1s value is converted to ticks using the pdMS_TO_TICKS() macro. */
#define mainQUEUE_TICK_COUNT_FOR_1S pdMS_TO_TICKS(1000)
#else
/* For RTL Simulation we reduce the waiting timing, otherwise the simulation
 * will take too more time */
/* The 10ms value is converted to ticks using the pdMS_TO_TICKS() macro. */
#define mainQUEUE_TICK_COUNT_FOR_1S pdMS_TO_TICKS(10)
#endif
/* The maximum number items the queue can hold.  The priority of the receiving
task is above the priority of the sending task, so the receiving task will
preempt the sending task and remove the queue items each time the sending task
writes to the queue.  Therefore the queue will never have more than one item in
it at any time, and even with a queue length of 1, the sending task will never
find the queue full. */
#define mainQUEUE_LENGTH (1)

#if (portUSING_MPU_WRAPPERS == 1)
/**
 * @brief Calls the port specific code to raise the privilege.
 *
 * @return pdFALSE if privilege was raised, pdTRUE otherwise.
 */
BaseType_t xPortRaisePrivilege(void) FREERTOS_SYSTEM_CALL;
extern pmp_info_t xPmpInfo;
#endif

/*-----------------------------------------------------------*/
/*
 * Functions:
 * 		- prvSetupHardware: Setup Hardware according CPU and Board.
 */
static void prvSetupHardware(void);

/*
 * The tasks as described in the comments at the top of this file.
 */
static void prvQueueReceiveTask(void *pvParameters);
static void prvQueueSendTask(void *pvParameters);
static void vTaskCode(void *pvParameters) PRIVILEGED_FUNCTION;

/**
 * @brief Implements the task which has Read Only access to the memory region
 * ucSharedMemory.
 *
 * @param pvParameters[in] Parameters as passed during task creation.
 */
static void prvROAccessTask(void *pvParameters);

/**
 * @brief Implements the task which has Read Write access to the memory region
 * ucSharedMemory.
 *
 * @param pvParameters[in] Parameters as passed during task creation.
 */
static void prvRWAccessTask(void *pvParameters);

/**
 * @brief Size of the shared memory region.
 */
#define SHARED_MEMORY_SIZE 16

/**
 * @brief Memory region shared between two tasks.
 */
__attribute__((aligned(128))) uint8_t ucSharedMemory[SHARED_MEMORY_SIZE];
// static uint8_t ucSharedMemory1[ SHARED_MEMORY_SIZE ] __attribute__( ( aligned( 32 ) ) );
// static uint8_t ucSharedMemory2[ SHARED_MEMORY_SIZE ] __attribute__( ( aligned( 32 ) ) );

static StackType_t xSendTaskStack[configMINIMAL_STACK_SIZE] __attribute__((aligned(128)));
static StackType_t xReceiveTaskStack[configMINIMAL_STACK_SIZE] __attribute__((aligned(128)));
static StackType_t xROAccessTaskStack[configMINIMAL_STACK_SIZE] __attribute__((aligned(128)));
static StackType_t xRWAccessTaskStack[configMINIMAL_STACK_SIZE] __attribute__((aligned(128)));

/*-----------------------------------------------------------*/

/* The queue used by both tasks. */
static QueueHandle_t xQueue = NULL;

void _putchar(char character)
{
	MPU_bflb_uart_putchar(uart0, character);
}

/*-----------------------------------------------------------*/

static void prvROAccessTask(void *pvParameters)
{
	/* Unused parameters. */
	(void)pvParameters;

	if (portIS_PRIVILEGED() == 1) {
		printf("ROAccess task is running in priveleged mode\r\n");
	} else {
		printf("ROAccess task is running in unpriveleged mode\r\n");
	}

	// ucSharedMemory[ 0 ] = 1;

	for (;;)
	{
		/* Wait for a 3 seconds. */
		vTaskDelay(pdMS_TO_TICKS(3 * 1000));
		// vTaskDelete(NULL);
	}
}
/*-----------------------------------------------------------*/

static void prvRWAccessTask(void *pvParameters)
{
	/* Unused parameters. */
	(void)pvParameters;

	if (portIS_PRIVILEGED() == 1) {
		printf("RWAccess task is running in priveleged mode\r\n");
	} else {
		printf("RWAccess task is running in unpriveleged mode\r\n");
	}

	// printf("[ RWAccess ] : ucSharedMemory[0] = %d\r\n", ucSharedMemory[0]);
	// ucSharedMemory[0] = 1;
	// printf("[ RWAccess ] : ucSharedMemory[0] = %d\r\n", ucSharedMemory[0]);
	// metal_tty_putc( '#' );

	for (;;)
	{
		/* This task has RW access to ucSharedMemory and therefore can write to
		 * it. */
		// ucSharedMemory[ 0 ] = 0;

		/* Wait for a 3 seconds. */
		vTaskDelay(pdMS_TO_TICKS(3 * 1000));
		// vTaskDelete(NULL);
	}
}
/*-----------------------------------------------------------*/

/**
 * @brief         clnSrvTask - cleaning service.
 *
 * @param         None
 *
 * @returns       None
 */
static void clnSrvTask(void *pvParameters)
{
	const TickType_t xDelay = 1000 / portTICK_PERIOD_MS;

	(void)pvParameters;

	do {
		vTaskPrioritySet(xTaskGetIdleTaskHandle(), uxTaskPriorityGet(xTaskGetCurrentTaskHandle()));
		//    taskYIELD();
		vTaskDelay(xDelay);
		vTaskPrioritySet(xTaskGetIdleTaskHandle(), tskIDLE_PRIORITY);
		vTaskDelay(xDelay);
	} while (1);
}

#define BUFFER_SIZE 300
// static __attribute__ ((aligned(16))) StackType_t xISRStack[ configMINIMAL_STACK_SIZE  + 1 ] = { 0 }; //__attribute__ ((section (".heap"))) ;
static __attribute__((aligned(16))) StackType_t xISRStack[configISR_STACK_SIZE_WORDS] = {0}; //__attribute__ ((section (".heap"))) ;
__attribute__((aligned(4))) uint8_t ucHeap[configTOTAL_HEAP_SIZE] __attribute__((section(".heap")));

// void *aligned_malloc(size_t size, size_t alignment)
// {
// 	// Allocate additional space for saving the original address and for alignment
// 	uintptr_t raw_address = (uintptr_t)pvPortMalloc(size + alignment - 1 + sizeof(void *));

// 	if (!raw_address)
// 	{
// 		return NULL; // Memory allocation error
// 	}

// 	// Find the nearest aligned address
// 	uintptr_t aligned_address = (raw_address + sizeof(void *) + alignment - 1) & ~(alignment - 1);

// 	// Store the original address before the aligned address
// 	((void **)aligned_address)[-1] = (void *)raw_address;

// 	return (void *)aligned_address;
// }

// void aligned_free(void *aligned_ptr)
// {
// 	// Restore the original address and release it
// 	void *raw_address = ((void **)aligned_ptr)[-1];
// 	vPortFree(raw_address);
// }

/**
 * @brief         menuTask1 - .
 *
 * @param         None
 *
 * @returns       None
 */
static void menuTask(void *pvParameters) PRIVILEGED_FUNCTION
{
	/* Define a buffer that is large enough to hold the generated table.  In most
	 * cases the buffer will be too large to allocate on the stack, hence in this
	 * example it is declared static. */
	(void)pvParameters;

