Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
	static char cBuffer[BUFFER_SIZE];
	extern uint32_t __unprivileged_data_section_start__[];
	extern uint32_t __unprivileged_data_section_end__[];
	TaskHandle_t xHandle_TaskROAccess = NULL, xHandle_TaskRWAccess = NULL, xHandle_ReceiveTask = NULL, xHandle_SendTask = NULL;

	static TaskParameters_t xROAccessTaskParameters =
		{
			.pvTaskCode = prvROAccessTask,
			.pcName = "ROAccess",
			.usStackDepth = 128, // configMINIMAL_STACK_SIZE,
			.pvParameters = NULL,
			.uxPriority = mainQUEUE_SEND_TASK_PRIORITY,
			.puxStackBuffer = NULL,
			// .puxStackBuffer = xROAccessTaskStack,
		};

	static TaskParameters_t xRWAccessTaskParameters =
		{
			.pvTaskCode = prvRWAccessTask,
			.pcName = "RWAccess",
			.usStackDepth = 128, // configMINIMAL_STACK_SIZE,
			.pvParameters = NULL,
			.uxPriority = mainQUEUE_SEND_TASK_PRIORITY,
			.puxStackBuffer = NULL,
			// .puxStackBuffer = xRWAccessTaskStack,
		};
	static TaskParameters_t xTaskRXDefinition =
		{
			.pvTaskCode = prvQueueReceiveTask,
			.pcName = "Rx",
			.usStackDepth = configMINIMAL_STACK_SIZE,
			.pvParameters = NULL,
			.uxPriority = mainQUEUE_RECEIVE_TASK_PRIORITY,
			.puxStackBuffer = NULL,
			// .puxStackBuffer = xReceiveTaskStack,
		};
	static TaskParameters_t xTaskTXDefinition =
		{
			.pvTaskCode = prvQueueSendTask,
			.pcName = "Tx",
			.usStackDepth = configMINIMAL_STACK_SIZE,
			.pvParameters = NULL,
			.uxPriority = mainQUEUE_SEND_TASK_PRIORITY,
			.puxStackBuffer = NULL,
			// .puxStackBuffer = xSendTaskStack,
		};

	(void)pvParameters;
	int32_t lResult;
	extern uint32_t __unprivileged_data_section_start__[];
	extern uint32_t __unprivileged_data_section_end__[];
	extern uint32_t __tcm_code_start__[];
	extern uint32_t __tcm_code_end__[];
	extern uint32_t __tcm_data_end__[];
	extern uint32_t __tcm_data_start__[];
	extern uint32_t __ram_data_start__[];
	extern uint32_t privilege_status;

	int ch;
	do {
		portDISABLE_INTERRUPTS();
		printf("\n+- Menu -----------------------------------------------------+\r\n");
#ifdef CONFIG_APPS_HELLO_WORLD
		printf("| [1] - Run 2 unprvl apps & demo interaction between them    |\r\n");
		printf("| [2] - Delete 2 unprvl apps                                 |\r\n");
#endif
#ifdef CONFIG_APPS_HOTP
		printf("| [3] - Run HOTP (Ported from OP-TEE, user TA)               |\r\n");
#endif
		printf("| [4] - Get FreeRTOS Task List                               |\r\n");
#ifdef CONFIG_APPS_TEST
		printf("| [5] - Run Test Suite for GP TEE Client & Internal API      |\r\n");
#endif
#ifdef CONFIG_APPS_HW_SECURITY_EXCEPTION_EXAMPLE
		printf("| [6] - Run H/W Security exception example (from non-secure) |\r\n");
		printf("| [7] - Run H/W Security exception example (from secure)     |\r\n");
#endif
#ifdef CONFIG_APPS_SPY
		printf("| [8] - Run test & spy (trying to get protected data) unprvl |\r\n");
		printf("| [9] - Delete test & spy unprvl apps                        |\r\n");
#endif
		printf("+------------------------------------------------------------+\r\n");
		portENABLE_INTERRUPTS();
		while (1)
		{
			ch = bflb_uart_getchar(uart0);
			if (ch == -1) {
				// taskYIELD();
				// vTaskDelay(mainQUEUE_TICK_COUNT_FOR_1S);
			} else
				break;
		}
		printf("\n[%c]\r\n", (char)ch);

		switch (ch) {
#ifdef CONFIG_APPS_HELLO_WORLD
		case '1':
			xQueue = xQueueCreate(mainQUEUE_LENGTH, sizeof(uint32_t));

			if (xQueue != NULL) {
				/*
				 * Prepare xRegions for Receive Task
				 */
				memset(&xTaskRXDefinition.xRegions, 0, sizeof(xTaskRXDefinition.xRegions));

				// authorize access to data and bss
				// 		Low address
				// printf("xTaskRXDefinition.xRegions[0].pvBaseAddress = %p\r\n", xTaskRXDefinition.xRegions[0].pvBaseAddress);
				// 		High address

				xTaskRXDefinition.xRegions[0].ulLengthInBytes = 0x10000;
				xTaskRXDefinition.xRegions[0].ulParameters = ((portPMP_REGION_READ_WRITE) |
															  (portPMP_REGION_ADDR_MATCH_NAPOT));
				lResult = napot_addr_modifier(xPmpInfo.granularity,
											  (size_t)0xE0000000UL,
											  (size_t *)&xTaskRXDefinition.xRegions[0].pvBaseAddress,
											  xTaskRXDefinition.xRegions[0].ulLengthInBytes);
				if (lResult)
					printf("lResult R[0] = %d\r\n", lResult);

				xTaskRXDefinition.xRegions[1].ulLengthInBytes = 8192UL;
				xTaskRXDefinition.xRegions[1].ulParameters = ((portPMP_REGION_READ_ONLY) |
															  (portPMP_REGION_READ_WRITE) |
															  (portPMP_REGION_EXECUTE) |
															  (portPMP_REGION_ADDR_MATCH_NAPOT));
				lResult = napot_addr_modifier(xPmpInfo.granularity,
											  (size_t)0x62020000UL,
											  (size_t *)&xTaskRXDefinition.xRegions[1].pvBaseAddress,
											  xTaskRXDefinition.xRegions[1].ulLengthInBytes);
				if (lResult)
					printf("lResult R[1] = %d\r\n", lResult);

				xTaskRXDefinition.xRegions[2].ulLengthInBytes = 0x10000;
				xTaskRXDefinition.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
															  (portPMP_REGION_ADDR_MATCH_NAPOT));

				lResult = napot_addr_modifier(xPmpInfo.granularity,
											  (size_t)__ram_data_start__,
											  (size_t *)&xTaskRXDefinition.xRegions[2].pvBaseAddress,
											  xTaskRXDefinition.xRegions[2].ulLengthInBytes);
				if (lResult)
					printf("lResult R[2] = %d\r\n", lResult);

				// allocate stack (It will take 2 PMP Slot - So it is not needed to put align the StackBuffer)
				// xTaskRXDefinition.puxStackBuffer = ( StackType_t * ) pvPortMalloc( xTaskRXDefinition.usStackDepth * sizeof( StackType_t ));
				// xTaskRXDefinition.puxStackBuffer = (StackType_t *)aligned_malloc(xTaskRXDefinition.usStackDepth * sizeof(StackType_t), 128);
				xTaskRXDefinition.puxStackBuffer = xReceiveTaskStack;
				// printf("xTaskRXDefinition.puxStackBuffer = %p\r\n", xTaskRXDefinition.puxStackBuffer);
				xTaskCreateRestricted(&xTaskRXDefinition, &xHandle_ReceiveTask);

				/*
				 * Prepare xRegions for Send Task
				 */
				memset(&xTaskTXDefinition.xRegions, 0, sizeof(xTaskTXDefinition.xRegions));

				xTaskTXDefinition.xRegions[2].ulLengthInBytes = 0x10000;
				xTaskTXDefinition.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
															  (portPMP_REGION_ADDR_MATCH_NAPOT));

