Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
				lResult = napot_addr_modifier(xPmpInfo.granularity,
											  (size_t)__ram_data_start__,
											  (size_t *)&xTaskTXDefinition.xRegions[2].pvBaseAddress,
											  xTaskTXDefinition.xRegions[2].ulLengthInBytes);
				if (lResult)
					printf("lResult R[2] = %d\r\n", lResult);

				// authorize access to data and bss

				// 		High address

				// allocate stack (It will take 2 PMP Slot - So it is not needed to put align the StackBuffer)
				// xTaskTXDefinition.puxStackBuffer = ( StackType_t * ) pvPortMalloc( xTaskTXDefinition.usStackDepth * sizeof( StackType_t ) );
				// xTaskTXDefinition.puxStackBuffer = ( StackType_t * )aligned_malloc(xTaskTXDefinition.usStackDepth * sizeof( StackType_t ),128);
				xTaskTXDefinition.puxStackBuffer = xSendTaskStack;
				// printf("xTaskTXDefinition.puxStackBuffer = %p\r\n", xTaskTXDefinition.puxStackBuffer);

				xTaskCreateRestricted(&xTaskTXDefinition, &xHandle_SendTask);
			}

			break;
		case '2':
			if (xHandle_ReceiveTask != NULL)
				vTaskDelete(xHandle_ReceiveTask);
			if (xHandle_SendTask != NULL)
				vTaskDelete(xHandle_SendTask);
			// if (xTaskRXDefinition.puxStackBuffer != NULL) {
			// 	vPortFree(xTaskRXDefinition.puxStackBuffer);
			// 	xTaskRXDefinition.puxStackBuffer = NULL;
			// }
			// if (xTaskTXDefinition.puxStackBuffer != NULL)
			// {
			// 	vPortFree(xTaskTXDefinition.puxStackBuffer);
			// 	xTaskTXDefinition.puxStackBuffer = NULL;
			// }
			if (xQueue != NULL)
			{
				vQueueDelete(xQueue);
				xQueue = NULL;
			}
			break;
#endif
		case '4':
			/* Obtain the current tick count. */
			printf("\nAuto-reload timer callback executing = %d\r\n", xTaskGetTickCount());

			/* Pass the buffer into vTaskList() to generate the table of information. */
			vTaskList(cBuffer);
			portDISABLE_INTERRUPTS();
			printf("%s\n", cBuffer);
			portENABLE_INTERRUPTS();
			break;
#ifdef CONFIG_APPS_SPY
		case '8':
			/*
			 * Prepare xRegions for xROAccess Task
			 */
			memset(&xROAccessTaskParameters.xRegions, 0, sizeof(xROAccessTaskParameters.xRegions));

			// authorize access to data and bss
			// Low address

			xROAccessTaskParameters.xRegions[0].ulLengthInBytes = 0x10000;
			xROAccessTaskParameters.xRegions[0].ulParameters = ((portPMP_REGION_READ_WRITE) |
																(portPMP_REGION_ADDR_MATCH_NAPOT));
			lResult = napot_addr_modifier(xPmpInfo.granularity,
										  (size_t)0xE0000000UL,
										  (size_t *)&xROAccessTaskParameters.xRegions[0].pvBaseAddress,
										  xROAccessTaskParameters.xRegions[0].ulLengthInBytes);
			if (lResult)
				printf("lResult R[0] = %d\r\n", lResult);

			xROAccessTaskParameters.xRegions[1].ulLengthInBytes = 8192UL;
			xROAccessTaskParameters.xRegions[1].ulParameters = ((portPMP_REGION_READ_ONLY) |
																(portPMP_REGION_READ_WRITE) |
																(portPMP_REGION_EXECUTE) |
																(portPMP_REGION_ADDR_MATCH_NAPOT));
			lResult = napot_addr_modifier(xPmpInfo.granularity,
										  (size_t)0x62020000UL,
										  (size_t *)&xROAccessTaskParameters.xRegions[1].pvBaseAddress,
										  xROAccessTaskParameters.xRegions[1].ulLengthInBytes);
			if (lResult)
				printf("lResult R[1] = %d\r\n", lResult);

			xROAccessTaskParameters.xRegions[2].ulLengthInBytes = 0x10000;
			xROAccessTaskParameters.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
																(portPMP_REGION_ADDR_MATCH_NAPOT));

			lResult = napot_addr_modifier(xPmpInfo.granularity,
										  (size_t)__ram_data_start__,
										  (size_t *)&xROAccessTaskParameters.xRegions[2].pvBaseAddress,
										  xROAccessTaskParameters.xRegions[2].ulLengthInBytes);
			if (lResult)
				printf("lResult R[2] = %d\r\n", lResult);

			// xROAccessTaskParameters.puxStackBuffer = ( StackType_t * ) pvPortMalloc( xROAccessTaskParameters.usStackDepth * sizeof( StackType_t ) );
			// xROAccessTaskParameters.puxStackBuffer = ( StackType_t * )aligned_malloc(xROAccessTaskParameters.usStackDepth * sizeof( StackType_t ),128);
			xROAccessTaskParameters.puxStackBuffer = xROAccessTaskStack;
			// printf("xROAccessTaskParameters.puxStackBuffer = %p\r\n", xROAccessTaskParameters.puxStackBuffer);

			xTaskCreateRestricted(&xROAccessTaskParameters, &xHandle_TaskROAccess);

			/*
			 * Prepare xRegions for xRWAccess Task
			 */
			memset(&xRWAccessTaskParameters.xRegions, 0, sizeof(xRWAccessTaskParameters.xRegions));

			// authorize access to data and bss
			// Low address

			xRWAccessTaskParameters.xRegions[0].ulLengthInBytes = 0x10000;
			xRWAccessTaskParameters.xRegions[0].ulParameters = ((portPMP_REGION_READ_WRITE) |
																(portPMP_REGION_ADDR_MATCH_NAPOT));
			lResult = napot_addr_modifier(xPmpInfo.granularity,
										  (size_t)0xE0000000UL,
										  (size_t *)&xRWAccessTaskParameters.xRegions[0].pvBaseAddress,
										  xRWAccessTaskParameters.xRegions[0].ulLengthInBytes);
			if (lResult)
				printf("lResult R[0] = %d\r\n", lResult);

			xRWAccessTaskParameters.xRegions[1].ulLengthInBytes = 8192UL;
			xRWAccessTaskParameters.xRegions[1].ulParameters = ((portPMP_REGION_READ_ONLY) |
																(portPMP_REGION_READ_WRITE) |
																(portPMP_REGION_EXECUTE) |
																(portPMP_REGION_ADDR_MATCH_NAPOT));
			lResult = napot_addr_modifier(xPmpInfo.granularity,
										  (size_t)0x62020000UL,
										  (size_t *)&xRWAccessTaskParameters.xRegions[1].pvBaseAddress,
										  xRWAccessTaskParameters.xRegions[1].ulLengthInBytes);
			if (lResult)
				printf("lResult R[1] = %d\r\n", lResult);

			xRWAccessTaskParameters.xRegions[2].ulLengthInBytes = 0x10000;
			xRWAccessTaskParameters.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
																(portPMP_REGION_ADDR_MATCH_NAPOT));

			lResult = napot_addr_modifier(xPmpInfo.granularity,
										  (size_t)__ram_data_start__,
										  (size_t *)&xRWAccessTaskParameters.xRegions[2].pvBaseAddress,
										  xRWAccessTaskParameters.xRegions[2].ulLengthInBytes);
			if (lResult)
				printf("lResult R[2] = %d\r\n", lResult);

			// printf("xROAccessTaskParameters.xRegions[0].ulLengthInBytes = %d\r\n", xROAccessTaskParameters.xRegions[0].ulLengthInBytes);

			// xRWAccessTaskParameters.puxStackBuffer = ( StackType_t * ) pvPortMalloc( xRWAccessTaskParameters.usStackDepth * sizeof( StackType_t ) );
			// xRWAccessTaskParameters.puxStackBuffer = ( StackType_t * )aligned_malloc(xRWAccessTaskParameters.usStackDepth * sizeof( StackType_t ),128);
			xRWAccessTaskParameters.puxStackBuffer = xRWAccessTaskStack;
			// printf("xRWAccessTaskParameters.puxStackBuffer = %p\r\n", xRWAccessTaskParameters.puxStackBuffer);

