Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
			xTaskCreateRestricted(&xRWAccessTaskParameters, &xHandle_TaskRWAccess);

			// spyAppTask();
			break;
		case '9':
			if (xHandle_TaskROAccess != NULL)
				vTaskDelete(xHandle_TaskROAccess);
			if (xHandle_TaskRWAccess != NULL)
				vTaskDelete(xHandle_TaskRWAccess);
			// if (xROAccessTaskParameters.puxStackBuffer != NULL) {
			// 	vPortFree(xROAccessTaskParameters.puxStackBuffer);
			// 	xROAccessTaskParameters.puxStackBuffer = NULL;
			// }
			// if (xRWAccessTaskParameters.puxStackBuffer != NULL) {
			// 	vPortFree(xRWAccessTaskParameters.puxStackBuffer);
			// 	xRWAccessTaskParameters.puxStackBuffer != NULL;
			// }
			break;
#endif
		default:
			break;
		}
		taskYIELD();
		vTaskDelay(mainQUEUE_TICK_COUNT_FOR_1S);

	} while (1);
}

static void ledBlinkTask(void *pvParameters) PRIVILEGED_FUNCTION
{
	/* Remove compiler warning about unused parameter. */
	(void)pvParameters;

	struct bflb_device_s *gpio; // make instance of GPIO

	// Get gpio device handle, i.e.) define IC pin here where IC's GPIO = 26, pin silkscreen = 13
	// this is the GPIO device index that is referenced from 0, make sure to check the schematic
	gpio = bflb_device_get_by_name("gpio");

	// Set as gpio as output
	bflb_gpio_init(gpio, GPIO_PIN_26, GPIO_OUTPUT | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_0);

	// Turn ON pin
	bflb_gpio_set(gpio, GPIO_PIN_26);

	if (portIS_PRIVILEGED() == 1) {
		printf("ledBlinkTask task is running in priveleged mode\r\n");
	} else {
		printf("ledBlinkTask task is running in unpriveleged mode\r\n");
	}

	for (;;)
	{
		vTaskDelay(mainQUEUE_TICK_COUNT_FOR_1S);
		bflb_gpio_reset(gpio, GPIO_PIN_26);
		printf("[ledBlinkTask] Led OFF\r\n");
		vTaskDelay(mainQUEUE_TICK_COUNT_FOR_1S);
		bflb_gpio_set(gpio, GPIO_PIN_26);
		printf("[ledBlinkTask] Led ON\r\n");
	}
}
/*-----------------------------------------------------------*/

int main(void)
{
	const char *const pcMessageEndError = "Error: no enough PMP entry\r\n";
	const char *const pcMessageGranularityError = "Error: platform granularity no supported\r\n";

	extern uint32_t __unprivileged_data_section_start__[];
	extern uint32_t __unprivileged_data_section_end__[];
	extern uint32_t __unprivileged_section_start__[];
	extern uint32_t __unprivileged_section_end__[];

	// extern uint32_t __heap_start[];
	// extern uint32_t __heap_end[];
	// extern unsigned long __privileged_data_start__[];
	// extern unsigned long __privileged_data_end__[];
	extern unsigned long __privileged_functions_start__[];
	extern unsigned long __privileged_functions_end__[];
	// extern unsigned long metal_segment_stack_begin[];
	// extern unsigned long metal_segment_stack_end[];
	volatile unsigned long *pul;

	prvSetupHardware();

	printf("\n\n\t-= mTower v" VERSION " =-  " __DATE__ "  " __TIME__ "\r\n\n");

	// pul = __unprivileged_data_section_start__;
	// printf("__unprivileged_data_section_start__ = %p\r\n", pul);

	// pul = __unprivileged_data_section_end__;
	// printf("__unprivileged_data_section_end__ = %p\r\n", pul);

	extern uint32_t __text_code_start__[];
	extern uint32_t __text_code_end__[];
	extern uint32_t __tcm_code_start__[];
	extern uint32_t __tcm_code_end__[];

	extern uint32_t __fsymtab_start[];
	extern uint32_t __fsymtab_end[];
	extern uint32_t __vsymtab_start[];
	extern uint32_t __vsymtab_end[];
	extern uint32_t __usbh_class_info_end__[];

	// printf("__fsymtab_start                = %p\r\n", &__fsymtab_start);
	// printf("__fsymtab_end              	   = %p\r\n", &__fsymtab_end);
	// printf("__vsymtab_start            	   = %p\r\n", &__vsymtab_start);
	// printf("__vsymtab_end              	   = %p\r\n", &__vsymtab_end);

	// printf("__usbh_class_info_end__        = %p\r\n", &__usbh_class_info_end__);
	// pul = __unprivileged_section_start__;
	// printf("__unprivileged_section_start__ = %p\r\n", pul);

	// pul = __unprivileged_section_end__;
	// printf("__unprivileged_section_end__   = %p\r\n", pul);

	// pul = __privileged_functions_start__;
	// printf("__privileged_functions_start__ = %p\r\n", pul);

	// pul = __privileged_functions_end__;
	// printf("__privileged_functions_end__   = %p\r\n", pul);

	// printf("__text_code_start__            = %p\r\n", &__text_code_start__);
	extern uint32_t __tcm_data_end__[];
	extern uint32_t __tcm_data_start__[];
	// printf("__text_code_end__              = %p\r\n", __text_code_end__);
	// printf("__tcm_code_start__             = %p\r\n", __tcm_code_start__);
	// printf("__tcm_code_end__               = %p\r\n", __tcm_code_end__);
	// printf("__tcm_data_start__             = %p\r\n", __tcm_data_start__);
	// printf("__tcm_data_end__               = %p\r\n", __tcm_data_end__);
	// printf("uart0			               = %p\r\n", uart0);

	// printf("prvQueueReceiveTask = %p\r\n", prvQueueReceiveTask);
	// printf("MPU_vTaskDelay = %p\r\n", vTaskDelay);
	// printf("xIsPrivileged = %p\r\n", xIsPrivileged);
	// printf("bflb_uart_putchar = %p\r\n", bflb_uart_putchar);
	// bflb_uart_putchar

	// pul = __privileged_data_start__;
	// printf("__privileged_data_start__ = %p\r\n", pul);

	// pul = __privileged_data_end__;
	// printf("__privileged_data_end__ = %p\r\n", pul);

	// pul = metal_segment_stack_begin;
	// printf("metal_segment_stack_begin = %p\r\n", pul);

	// pul = metal_segment_stack_end;
	// printf("metal_segment_stack_end = %p\r\n", pul);

	// pul = __heap_start;
	// printf("__heap_start = %p\r\n", pul);

	// pul = __heap_end;
	// printf("__heap_end = %p\r\n", pul);

	// printf("sizeof( StackType_t ) = %d\r\n", sizeof( StackType_t ));
	// printf("portTOTAL_NUM_CFG_REG = %d\r\n", portTOTAL_NUM_CFG_REG);

	// printf("xISRStack = %p\r\n",(StackType_t)&( xISRStack[ ( (configMINIMAL_STACK_SIZE - 1) & ~portBYTE_ALIGNMENT_MASK ) ] ));
	// printf("xISRStack = %p\r\n",&( xISRStack ));

	/*
	 * Call xPortFreeRTOSInit in order to set xISRTopStack
	 */
	if (0 != xPortFreeRTOSInit((StackType_t) & (xISRStack[((configMINIMAL_STACK_SIZE - 1) & ~portBYTE_ALIGNMENT_MASK)]))) {
		printf("xPortFreeRTOSInit: ERROR");
		_exit(-1);
	}

	BaseType_t xReturned;
	TaskHandle_t xHandle = NULL;

	xTaskCreate(menuTask,										  /* The function that implements the task. */
				"menu",											  /* The text name assigned to the task - for debug only as it is not used by the kernel. */
				512,											  /* The size of the stack to allocate to the task. */
				(void *)NULL,									  /* The parameter passed to the task - just to check the functionality. */
				mainQUEUE_SEND_TASK_PRIORITY | portPRIVILEGE_BIT, /* The priority assigned to the task. */
				NULL);

	xTaskCreate(ledBlinkTask,									  /* The function that implements the task. */
				"ledBlink",										  /* The text name assigned to the task - for debug only as it is not used by the kernel. */
				128,											  /* The size of the stack to allocate to the task. */
				(void *)NULL,									  /* The parameter passed to the task - just to check the functionality. */
				mainQUEUE_SEND_TASK_PRIORITY | portPRIVILEGE_BIT, /* The priority assigned to the task. */
				NULL);

