Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
#if (portUSING_MPU_WRAPPERS == 1)
	if (xPmpInfo.nb_pmp < 8) {
		printf("%s", pcMessageEndError);
		_exit(0);
		// } else if (xPmpInfo.granularity > 4) {
	} else if (xPmpInfo.granularity > 128) {
		/*
		 * platfrom granularity > 4 bytes is not supported yet, some
		 * modifications are needed on FreeRTOS port to do so.
		 */
		printf("%s", pcMessageGranularityError);
		_exit(0);
	}

	// printf("xPmpInfo.nb_pmp = %d\r\n", xPmpInfo.nb_pmp);
	// printf("xPmpInfo.granularity= %d\r\n", xPmpInfo.granularity);

	if (0 == xPmpInfo.granularity) {
		init_pmp(&xPmpInfo);
	}

	/* Start the tasks and timer running. */
	vTaskStartScheduler();

	/* If all is well, the scheduler will now be running, and the following
	line will never be reached.  If the following line does execute, then
	there was insufficient FreeRTOS heap memory available for the Idle and/or
	timer tasks to be created.
	or task have stoppped the Scheduler */

	// vTaskDelete( xHandle_SendTask );
	// vTaskDelete( xHandle_ReceiveTask );
#endif /* ( portUSING_MPU_WRAPPERS == 1 ) */
}
/*-----------------------------------------------------------*/

static __attribute__((section(".unprivileged_section"))) void prvQueueSendTask(void *pvParameters)
{
	TickType_t xNextWakeTime;
	BaseType_t xReturned;
	unsigned long ulCounter = 0;

	/* Remove compiler warning about unused parameter. */
	(void)pvParameters;
	(void)xReturned;

	printf("prvQueueSendTask task: ");
	if (portIS_PRIVILEGED() == 1) {
		printf("TX task is running in priveleged mode\r\n");
	} else {
		printf("Tx task is running in unpriveleged mode\r\n");
	}

	/* Initialise xNextWakeTime - this only needs to be done once. */
	xNextWakeTime = xTaskGetTickCount();

	for (;;)
	{
		printf("[ Tx ] : %d\r\n", ++ulCounter);

		/* Place this task in the blocked state until it is time to run again. */
		vTaskDelayUntil(&xNextWakeTime, mainQUEUE_TICK_COUNT_FOR_1S);
		// vTaskDelay( mainQUEUE_TICK_COUNT_FOR_1S * 500);

		/* Send to the queue - causing the queue receive task to unblock and
		toggle the LED.  0 is used as the block time so the sending operation
		will not block - it shouldn't need to block as the queue should always
		be empty at this point in the code. */
		xReturned = xQueueSend(xQueue, &ulCounter, 0U);
		configASSERT(xReturned == pdPASS);
	}

	/**
	 * SiFive CI/CD need to have a exit(0) status to pass
	 */
#if (portUSING_MPU_WRAPPERS == 1)
	/* We run into user mode, so need to be machine mode before to call vTaskEndScheduler */
	// xPortRaisePrivilege();
#endif /* ( portUSING_MPU_WRAPPERS == 1 ) */
	   // vTaskEndScheduler();
}
/*-----------------------------------------------------------*/

static __attribute__((section(".unprivileged_section"))) void prvQueueReceiveTask(void *pvParameters)
{
	unsigned long ulReceivedValue;

	/* Remove compiler warning about unused parameter. */
	(void)pvParameters;

	printf("prvQueueReceiveTask task: ");
	if (portIS_PRIVILEGED() == 1) {
		printf("RX task is running in priveleged mode\r\n");
	} else {
		printf("Rx task is running in unpriveleged mode\r\n");
	}

	for (;;)
	{
		/* Wait until something arrives in the queue - this task will block
		indefinitely provided INCLUDE_vTaskSuspend is set to 1 in
		FreeRTOSConfig.h. */
		xQueueReceive(xQueue, &ulReceivedValue, portMAX_DELAY);

		/*  To get here something must have been received from the queue, but
		is it the expected value?  If it is, toggle the LED. */

		printf("[ Rx ] : %d\r\n", ulReceivedValue);
	}
}
/*-----------------------------------------------------------*/

static void prvSetupHardware(void)
{
	board_init();
	uart0 = bflb_device_get_by_name("uart0");
	bflb_uart_set_console(bflb_device_get_by_name("uart0"));
}
/*-----------------------------------------------------------*/

__attribute__((weak)) void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName)
{
	printf("vApplicationStackOverflowHook\r\n");
	_exit(-1);
}
/*-----------------------------------------------------------*/

__attribute__((weak)) void vApplicationMallocFailedHook(void)
{
	const char *const pcErrorMsg = "ERROR malloc \r\n";
	printf("vApplicationMallocFailedHook\r\n");
	printf(pcErrorMsg);
	_exit(-1);
}
/*-----------------------------------------------------------*/

__attribute__((weak)) void vApplicationGetIdleTaskMemory(StaticTask_t **ppxIdleTaskTCBBuffer, StackType_t **ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize)
{
	/* If the buffers to be provided to the Idle task are declared inside this
	function then they must be declared static - otherwise they will be allocated on
	the stack and so not exists after this function exits. */
	static StaticTask_t xIdleTaskTCB;
	static StackType_t uxIdleTaskStack[configMINIMAL_STACK_SIZE];

	/* Pass out a pointer to the StaticTask_t structure in which the Idle task's
	state will be stored. */
	*ppxIdleTaskTCBBuffer = &xIdleTaskTCB;

	/* Pass out the array that will be used as the Idle task's stack. */
	*ppxIdleTaskStackBuffer = uxIdleTaskStack;

	/* Pass out the size of the array pointed to by *ppxIdleTaskStackBuffer.
	Note that, as the array is necessarily of type StackType_t,
	configMINIMAL_STACK_SIZE is specified in words, not bytes. */
	*pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
}
/*-----------------------------------------------------------*/

void vApplicationTickHook(void)
{
	/* The tests in the full demo expect some interaction with interrupts. */
	// printf("vApplicationTickHook\r\n");
}
/*-----------------------------------------------------------*/

/* configSUPPORT_STATIC_ALLOCATION and configUSE_TIMERS are both set to 1, so the
application must provide an implementation of vApplicationGetTimerTaskMemory()
to provide the memory that is used by the Timer service task. */
__attribute__((weak)) void vApplicationGetTimerTaskMemory(StaticTask_t **ppxTimerTaskTCBBuffer, StackType_t **ppxTimerTaskStackBuffer, uint32_t *pulTimerTaskStackSize)
{
	/* If the buffers to be provided to the Timer task are declared inside this
	function then they must be declared static - otherwise they will be allocated on
	the stack and so not exists after this function exits. */
	static StaticTask_t xTimerTaskTCB;
	static StackType_t uxTimerTaskStack[configTIMER_TASK_STACK_DEPTH];

	/* Pass out a pointer to the StaticTask_t structure in which the Timer
	task's state will be stored. */
	*ppxTimerTaskTCBBuffer = &xTimerTaskTCB;

	/* Pass out the array that will be used as the Timer task's stack. */
	*ppxTimerTaskStackBuffer = uxTimerTaskStack;

	/* Pass out the size of the array pointed to by *ppxTimerTaskStackBuffer.
	Note that, as the array is necessarily of type StackType_t,
	configTIMER_TASK_STACK_DEPTH is specified in words, not bytes. */
	*pulTimerTaskStackSize = configTIMER_TASK_STACK_DEPTH;
}
